artillery-load-test.yml
config:
    # target: 'https://nepaltoday-api-qa.herokuapp.com'
    target: 'http://localhost:8080'
    phases:
        - duration: 60
          arrivalRate: 5
    defaults:
        headers:
            'content-type': 'application/json'
            'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:75.0) Gecko/20100101 Firefox/75.0'
            'Connection': 'keep-alive'
            'Accept': '*/*'
scenarios:
    - flow:
          - post:
                url: '/graphql'
                json:
                    query: '{  getArticles {    _id    title    shortDescription    content    source {      _id      name    }  }}'
          - think: 3
          - post:
                url: '/graphql'
                json:
                    query: '{  getTweets {    _id    text    handle    profileImage    description  }}'
          - think: 3
          - post:
                url: '/graphql'
                json:
                    query: '{  getLatestCoronaStats {    createdDate    stats {      country      total_cases      total_deaths      new_cases      new_deaths    }  }}'